PaymentCreateAllISPC/results/20211007/BMPaymentV21/PAYCTFORDOMOUPNPWOA_1.8_PaymentCreate2.120211007153549678.txt

Status: PASS
Time Taken: 2502
Size: 4059
Timestamp: Thu Oct 07 15:35:47 IST 2021
TestStep: PaymentCreate2.1

----------------- Messages ------------------------------

----------------- Properties ------------------------------
Endpoint: http://10.246.89.109:20811/pin/services/PINSPayment_V2_1
Encoding: UTF-8

---------------- Request ---------------------------
Request Headers: SOAPAction : ""
Connection : Keep-Alive
User-Agent : Apache-HttpClient/4.5.2 (Java/16.0.1)
Host : 10.246.89.109:20811
Accept-Encoding : gzip,deflate
Content-Length : 5009
Content-Type : text/xml;charset=UTF-8


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsc="http://edb.com/ws/WSCommon_v22" xmlns:urn="urn:pins.payment.tietoevry.com:ws:paymentinitiation:v2_1" xmlns:urn1="urn:pins.payment.tietoevry.com:domain:paymentinitiation:v2_1" xmlns:urn2="urn:pins.payment.tietoevry.com:domain:complex-types:v2_1" xmlns:urn3="urn:pins.payment.tietoevry.com:domain:debtor:v2_1" xmlns:urn4="urn:pins.payment.tietoevry.com:domain:creditor:v2_1">
   <soapenv:Header>
      <wsc:AutHeader>
         <wsc:SourceApplication>EVRYCPS</wsc:SourceApplication>
         <wsc:DestinationApplication>PIN</wsc:DestinationApplication>
         <wsc:Function>paymentAuthorizationCreate</wsc:Function>
         <wsc:Version>1.0</wsc:Version>
         <wsc:ClientContext>
            <wsc:userid>55057203187</wsc:userid>
            <wsc:credentials>03111012010400425kbKcJMZoMF56OVtVL1neI9CfuAtjCBO603eS0IgWm1WWIO7EfpSL4DE/lDFi69n1sSaabKNt2t+xJppso23a37EmmmyjbdrfF3M0FKxtlD/HJbEkbc46/BMCstNp869esSaabKNt2t/XzlyjxYnxhcG46wcbIKp/sSaabKNt2t9wBUG0SyIoqFfig80Gq4uXVBtimDzTiu3EfQIWD5xMfslE2lt0gldZQIyIMvAwCMo=Owe13MJu4QRF5Vj5fdm42aK3nL6InZ7iUXQ2d3QvsDlp4SRrFo03WNE0BwBvlyk3Y5tHWP+DVGwZTtsKKiL4yr1VcsAzMmjub6dAdZ8J2NSTeOl14BcfV4hHDqgvdtQ6wTLSNlDSmdoQHUgDHgLgF/oRUnWDutHal9uw/ZEemPI=</wsc:credentials>
            <wsc:channel>BES</wsc:channel>
            <wsc:orgid>2544</wsc:orgid>
            <!--Optional:-->
            <wsc:orgunit>2544</wsc:orgunit>
            <!--Optional:-->
            <wsc:customerid>55057203187</wsc:customerid>
            <!--Optional:-->
            <wsc:locale>en</wsc:locale>
            <wsc:ip>1.1.1.1</wsc:ip>
            <!--Zero or more repetitions:-->
            <wsc:item key="PaymentChannel" value="BES"/>
            <wsc:item key="LogRef" value="2544bank"/>
            <wsc:item key="AgreementId" value="55057203187"/>
         </wsc:ClientContext>
      </wsc:AutHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn:PaymentCreateRequest>
         <urn:paymentMessage>
            <urn1:paymentIdentification>
               <urn2:messageIdentification>4282325</urn2:messageIdentification>
               <urn2:endToEndIdentification>2327058</urn2:endToEndIdentification>
               <!--Optional:-->
            </urn1:paymentIdentification>
            <urn1:paymentInfo>
               <urn3:paymentMethod>TRF</urn3:paymentMethod>
               <!--Optional:-->
               <urn3:paymentTypeInformation>
                  <!--Optional:-->
                  <!--Optional:-->
                  <!--Optional:-->
                  <!--Optional:-->
                  <urn3:instructionPriority>NORM</urn3:instructionPriority>
                  <urn3:serviceLevel>NOCR</urn3:serviceLevel>
                  <urn3:categoryPurpose>SUPP</urn3:categoryPurpose>
               </urn3:paymentTypeInformation>
               <urn3:requestedExecutionDate>2021-10-07</urn3:requestedExecutionDate>
               <urn3:debtorAccount>
                  <urn2:identification>36281079039</urn2:identification>
                  <urn2:currency>NOK</urn2:currency>
               </urn3:debtorAccount>
               <urn3:debtorAgentBIC>SPAVNOBBXXX</urn3:debtorAgentBIC>
               <urn3:debtor>
                  <urn2:name>debt</urn2:name>
                  <urn2:postalAddress>
                     <urn2:addressType>ADDR</urn2:addressType>
                     <urn2:department>adfa</urn2:department>
                     <urn2:subDepartment>adfa</urn2:subDepartment>
                     <urn2:streetName>stret</urn2:streetName>
                     <urn2:buildingNumber>123</urn2:buildingNumber>
                     <urn2:postCode>7913</urn2:postCode>
                     <urn2:townName>terr</urn2:townName>
                     <urn2:country>NO</urn2:country>
                  </urn2:postalAddress>
               </urn3:debtor>
            </urn1:paymentInfo>
            <urn1:transaction>
               <urn4:amount>
                  <urn2:instructedAmount currency="NOK">
                     <urn2:amount>1</urn2:amount>
                  </urn2:instructedAmount>
               </urn4:amount>
               <urn4:chargeBearer>SHAR</urn4:chargeBearer>
               <urn4:creditorAgent>
                  <urn2:bic>VEFONO21XXX</urn2:bic>
                  <urn2:postalAddress>
                     <urn2:addressType>ADDR</urn2:addressType>
                     <urn2:postCode>1122</urn2:postCode>
                     <urn2:country>NO</urn2:country>
                  </urn2:postalAddress>
               </urn4:creditorAgent>
               <urn4:creditorAccount>
                  <urn2:identification>24801016517</urn2:identification>
                  <urn2:currency>NOK</urn2:currency>
               </urn4:creditorAccount>
            </urn1:transaction>
            <!--Optional:-->
            <!--Optional:-->
            <!--Optional:-->
         </urn:paymentMessage>
      </urn:PaymentCreateRequest>
   </soapenv:Body>
</soapenv:Envelope>

---------------- Response --------------------------
Response Headers: Transfer-Encoding : chunked
Server : Jetty(9.4.34.v20201102)
X-sorp : 55057203187;2544;55057203187;EVRYCPS;PIN;PINSPayment_V2_1.PaymentCreate;-;2544bank;0;0;false
#status# : HTTP/1.1 200 OK
Content-Type : text/xml;charset=utf-8


<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <ns2:PaymentCreateResponse xmlns:ns10="urn:pins.payment.tietoevry.com:ws:paymentutil:v2_1" xmlns:ns9="urn:pins.payment.tietoevry.com:domain:paymentutil:v2_1" xmlns:ns8="urn:pins.payment.tietoevry.com:domain:nationalinformation-nor:v2_1" xmlns:ns7="urn:pins.payment.tietoevry.com:domain:creditor:v2_1" xmlns:ns6="urn:pins.payment.tietoevry.com:domain:debtor:v2_1" xmlns:ns5="urn:pins.payment.tietoevry.com:domain:complex-types:v2_1" xmlns:ns4="urn:pins.payment.tietoevry.com:domain:paymentinitiation:v2_1" xmlns:ns3="urn:pins.payment.tietoevry.com:domain:common:v2_1" xmlns:ns2="urn:pins.payment.tietoevry.com:ws:paymentinitiation:v2_1" xmlns="http://edb.com/ws/WSCommon_v22">
         <ns3:ResponseState>
            <ErrorCode>0</ErrorCode>
            <Severity>0</Severity>
            <ComponentId>111</ComponentId>
            <Message>OK</Message>
            <LogSequence xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <errorItem key="6456" value="A similar payment was recently added. Make sure it is not a mistake."/>
         </ns3:ResponseState>
         <ns2:paymentResult>
            <ns4:messageId>1025836</ns4:messageId>
            <ns4:paymentInfoId>1119285</ns4:paymentInfoId>
            <ns4:transactionId>260897251</ns4:transactionId>
            <ns4:initiatorIdentifier>55057203187</ns4:initiatorIdentifier>
            <ns4:paymentReference>260897251</ns4:paymentReference>
            <ns4:releaseDate>2021-10-07+02:00</ns4:releaseDate>
            <ns4:internalProductCode>PAYCTFORDOMOUPNPWOA</ns4:internalProductCode>
            <ns4:paymentProduct>PI Domestic</ns4:paymentProduct>
            <ns4:transactionFee currency="NOK">
               <ns5:amount>5.00</ns5:amount>
            </ns4:transactionFee>
            <ns4:additionalServiceCharge>
               <ns5:serviceName>PI Foreign Account</ns5:serviceName>
               <ns5:charge currency="NOK">
                  <ns5:amount>3.00</ns5:amount>
               </ns5:charge>
            </ns4:additionalServiceCharge>
            <ns4:paymentIdentification>
               <ns5:messageIdentification>4282325</ns5:messageIdentification>
               <ns5:endToEndIdentification>2327058</ns5:endToEndIdentification>
            </ns4:paymentIdentification>
            <ns4:groupHeader>
               <ns5:creationDateTime>2021-10-07T12:05:47.121+02:00</ns5:creationDateTime>
            </ns4:groupHeader>
            <ns4:paymentInfo>
               <ns6:paymentMethod>TRF</ns6:paymentMethod>
               <ns6:paymentTypeInformation>
                  <ns6:instructionPriority>NORM</ns6:instructionPriority>
                  <ns6:serviceLevel>NOCR</ns6:serviceLevel>
                  <ns6:categoryPurpose>SUPP</ns6:categoryPurpose>
               </ns6:paymentTypeInformation>
               <ns6:requestedExecutionDate>2021-10-07+02:00</ns6:requestedExecutionDate>
               <ns6:debtorAccount>
                  <ns5:identification>36281079039</ns5:identification>
                  <ns5:currency>NOK</ns5:currency>
               </ns6:debtorAccount>
               <ns6:debtorAgentBIC>SPAVNOBBXXX</ns6:debtorAgentBIC>
               <ns6:debtor>
                  <ns5:id>
                     <ns5:OrgId>
                        <ns5:Id>55057203187</ns5:Id>
                     </ns5:OrgId>
                  </ns5:id>
                  <ns5:name>debt</ns5:name>
                  <ns5:postalAddress>
                     <ns5:addressType>ADDR</ns5:addressType>
                     <ns5:department>adfa</ns5:department>
                     <ns5:subDepartment>adfa</ns5:subDepartment>
                     <ns5:streetName>stret</ns5:streetName>
                     <ns5:buildingNumber>123</ns5:buildingNumber>
                     <ns5:postCode>7913</ns5:postCode>
                     <ns5:townName>terr</ns5:townName>
                     <ns5:country>NO</ns5:country>
                  </ns5:postalAddress>
               </ns6:debtor>
            </ns4:paymentInfo>
            <ns4:transaction>
               <ns7:amount>
                  <ns5:instructedAmount currency="NOK">
                     <ns5:amount>1.00</ns5:amount>
                  </ns5:instructedAmount>
               </ns7:amount>
               <ns7:chargeBearer>SHAR</ns7:chargeBearer>
               <ns7:creditorAgent>
                  <ns5:bic>VEFONO21XXX</ns5:bic>
                  <ns5:nationalId>2544</ns5:nationalId>
                  <ns5:postalAddress>
                     <ns5:addressType>ADDR</ns5:addressType>
                     <ns5:postCode>1122</ns5:postCode>
                     <ns5:country>NO</ns5:country>
                  </ns5:postalAddress>
               </ns7:creditorAgent>
               <ns7:creditor/>
               <ns7:creditorAccount>
                  <ns5:identification>24801016517</ns5:identification>
                  <ns5:currency>NOK</ns5:currency>
               </ns7:creditorAccount>
               <ns7:confidential>false</ns7:confidential>
               <ns7:uetrId>37237d5c-ffa5-4a31-9d6c-c1d27b2fb67b</ns7:uetrId>
               <ns4:operationsArray>CONFIRM_PAYMENT</ns4:operationsArray>
               <ns4:operationsArray>UPDATE_PAYMENT</ns4:operationsArray>
               <ns4:operationsArray>VIEW_PAYMENT</ns4:operationsArray>
            </ns4:transaction>
            <ns4:marketType>BM</ns4:marketType>
            <ns4:paymentStatus>VALIDATED</ns4:paymentStatus>
         </ns2:paymentResult>
      </ns2:PaymentCreateResponse>
   </soap:Body>
</soap:Envelope>
